---
kind: method
id: M:Autodesk.Revit.DB.Floor.GetSlabShapeEditor
zh: 楼板、板、地板
source: html/0542ebc4-7ce6-023c-3801-860c4bf98134.htm
---
# Autodesk.Revit.DB.Floor.GetSlabShapeEditor Method

**中文**: 楼板、板、地板

Gets a SlabShapeEditor that can be used to add or modify points of this Floor.

## Syntax (C#)
```csharp
public SlabShapeEditor GetSlabShapeEditor()
```

## Returns
The SlabShapeEditor object